<?php

if (!function_exists('__jobs1_1_1')) {
    function __jobs1_1_1()
    {
        return [
            [
                'id'    => 1,
                'label' => '1.การเกษตร'
            ],

            [
                'id'    => 2,
                'label' => '2.กีฬา'
            ],

            [
                'id'    => 3,
                'label' => '3.ศาสนา'
            ],

            [
                'id'    => 4,
                'label' => '4.ศิลปะ'
            ],

            [
                'id'    => 5,
                'label' => '5.การแสดง'
            ],

            [
                'id'    => 6,
                'label' => '6.ดนตรี'
            ],

            [
                'id'    => 7,
                'label' => '7.ขับร้อง'
            ],

            [
                'id'    => 8,
                'label' => '8.ภูมิปัญญา'
            ],

            [
                'id'    => 9,
                'label' => '9.โหราศาสตร์/หมอดู'
            ],
            [
                'id'    => 10,
                'label' => '10.ไสยศาสตร์'
            ],
            [
                'id'    => 11,
                'label' => '11.หัตถกรรม'
            ],
            [
                'id'    => 12,
                'label' => '12.ช่าง'
            ],
            [
                'id'    => 13,
                'label' => '13.สุขภาพ'
            ],
            [
                'id'    => 14,
                'label' => '14.สมุนไพร'
            ],
            [
                'id'    => 15,
                'label' => '15.การสื่อสารและประชาสัมพันธ์'
            ],
            [
                'id'    => 16,
                'label' => '16.วิทยากร'
            ],
            [
                'id'    => 17,
                'label' => '17.ภาษา'
            ],
            [
                'id'    => 18,
                'label' => '18.การเงิน/บัญชี'
            ],
            [
                'id'    => 19,
                'label' => '19.การควบคุมเครื่องจักรกล'
            ],
            [
                'id'    => 20,
                'label' => '20.เทคโนโลยี'
            ],
            [
                'id'    => 21,
                'label' => '21.อื่นๆ (ระบุ)'
            ],
            [
                'id'    => 22,
                'label' => '22.ไม่มี'
            ]

        ];
    }
}

if (!function_exists('__jobs1_1_2')) {
    function __jobs1_1_2()
    {
        return [
            [
                'id'    => 1,
                'label' => '1.ไทย'
            ],

            [
                'id'    => 2,
                'label' => '2.จีน'
            ],

            [
                'id'    => 3,
                'label' => '3.เวียดนาม'
            ],

            [
                'id'    => 4,
                'label' => '4.ลาว'
            ],

            [
                'id'    => 5,
                'label' => '5.เขรม'
            ],

            [
                'id'    => 6,
                'label' => '6.พม่า'
            ],

            [
                'id'    => 7,
                'label' => '7.มลายู'
            ],

            [
                'id'    => 8,
                'label' => '8.เกาหลี'
            ],

            [
                'id'    => 9,
                'label' => '9.ญี่ปุ่น'
            ],
            [
                'id'    => 10,
                'label' => '10.ฟิลิปปินส์'
            ],

            [
                'id'    => 11,
                'label' => '11.อังกฤษ'
            ],

            [
                'id'    => 12,
                'label' => '12.ฝรั่งเศส'
            ],

            [
                'id'    => 13,
                'label' => '13.อาหรับ'
            ],

            [
                'id'    => 14,
                'label' => '14.อื่นๆ(ระบุ)'
            ]
        ];
    }
}

if (!function_exists('__jobs1_1_3')) {
    function __jobs1_1_3()
    {
        return [
            [
                'id'    => 1,
                'label' => '1.ไทยกลาง'
            ],

            [
                'id'    => 2,
                'label' => '2.คำเมือง'
            ],

            [
                'id'    => 3,
                'label' => '3.ปกาเกอะญอ'
            ],

            [
                'id'    => 4,
                'label' => '4.ไทใหญ่'
            ],

            [
                'id'    => 5,
                'label' => '5.ยอง'
            ],

            [
                'id'    => 6,
                'label' => '6.อีสาน'
            ],

            [
                'id'    => 7,
                'label' => '7.เขรม'
            ],

            [
                'id'    => 8,
                'label' => '8.ส่วย'
            ],

            [
                'id'    => 9,
                'label' => '9.ภูไท'
            ],
            [
                'id'    => 10,
                'label' => '10.ปักใต้'
            ],

            [
                'id'    => 11,
                'label' => '11.ยาวี'
            ],

            [
                'id'    => 12,
                'label' => '12.อื่นๆ(ระบุ)'
            ]
        ];
    }
}

if (!function_exists('__jobs1_1_4')) {
    function __jobs1_1_4()
    {
        return [
            [
                'id'    => 1,
                'label' => '1.โสด'
            ],

            [
                'id'    => 2,
                'label' => '2.สมรสจดทะเบียน'
            ],

            [
                'id'    => 3,
                'label' => '3.สมรสไม่จดทะเบียน'
            ],

            [
                'id'    => 4,
                'label' => '4.อยู่ด้วยกันไม่สมรส'
            ],

            [
                'id'    => 5,
                'label' => '5.หม้าย'
            ],

            [
                'id'    => 6,
                'label' => '6.หย่า'
            ],

            [
                'id'    => 7,
                'label' => '7.แยกกันอยู่'
            ],

            [
                'id'    => 8,
                'label' => '8.อายุต่ำกว่า 15 ปี'
            ]
        ];
    }
}

if (!function_exists('__jobs1_1_5')) {
    function __jobs1_1_5()
    {
        return [
            [
                'id'    => 1,
                'label' => '1.ไม่ได้เรียน'
            ],

            [
                'id'    => 2,
                'label' => '2.กำลังศึกษา'
            ],

            [
                'id'    => 3,
                'label' => '3.จบการศึกษา'
            ],

            [
                'id'    => 4,
                'label' => '4.อายุต่ำกว่า 3 ปี'
            ]

        ];
    }
}

if (!function_exists('__jobs1_1_6')) {
    function __jobs1_1_6()
    {
        return [
            [
                'id'    => 1,
                'label' => '1.เตรียมอนุบาล (ศูนย์พัฒนาเด็กเล็ก)'
            ],

            [
                'id'    => 2,
                'label' => '2.อนุบาล'
            ],

            [
                'id'    => 3,
                'label' => '3.ประถมศึกษา'
            ],

            [
                'id'    => 4,
                'label' => '4.ม.ต้น'
            ],

            [
                'id'    => 5,
                'label' => '5.ม.ปลาย'
            ],

            [
                'id'    => 6,
                'label' => '6.ปวช.'
            ],

            [
                'id'    => 7,
                'label' => '7.ปวส.'
            ],

            [
                'id'    => 8,
                'label' => '8.อนุปริญญา'
            ],

            [
                'id'    => 9,
                'label' => '9.ปริญญาตรี'
            ],

            [
                'id'    => 10,
                'label' => '10.ปริญญาโท'
            ],

            [
                'id'    => 11,
                'label' => '11.ปริญญาเอก'
            ],

            [
                'id'    => 12,
                'label' => '12.ไม่ได้เรียน'
            ],

            [
                'id'    => 13,
                'label' => '13.ต่างประเทศ'
            ]

        ];
    }
}

if (!function_exists('__jobs1_1_7')) {
    function __jobs1_1_7()
    {
        return [
            [
                'id'    => 1,
                'label' => '1.อ่านไม่ได้'
            ],

            [
                'id'    => 2,
                'label' => '2.อ่านได้บ้างคำ'
            ],

            [
                'id'    => 3,
                'label' => '3.อ่านได้ดี'
            ]

        ];
    }
}

if (!function_exists('__jobs1_1_8')) {
    function __jobs1_1_8()
    {
        return [
            [
                'id'    => 1,
                'label' => '1.เขียนไม่ได้'
            ],

            [
                'id'    => 2,
                'label' => '2.เขียนได้บ้างคำ'
            ],

            [
                'id'    => 3,
                'label' => '3.เขียนได้ดี'
            ]

        ];
    }
}

if (!function_exists('__jobs1_1_9')) {
    function __jobs1_1_9()
    {
        return [
            [
                'id'    => 1,
                'label' => '1.คำนวณไม่ได้'
            ],

            [
                'id'    => 2,
                'label' => '2.คำนวณได้บ้างคำ'
            ],

            [
                'id'    => 3,
                'label' => '3.คำนวณได้ดี'
            ]

        ];
    }
}

if (!function_exists('__jobs1_1_10')) {
    function __jobs1_1_10()
    {
        return [
            [
                'id'    => 1,
                'label' => '1.หัวหน้าครัวเรือน'
            ],

            [
                'id'    => 2,
                'label' => '2.สามี/ภรรยา'
            ],

            [
                'id'    => 3,
                'label' => '3.บุตร'
            ],

            [
                'id'    => 4,
                'label' => '4.เขย/สะใภ้'
            ],

            [
                'id'    => 5,
                'label' => '5.บิดา/มารดา'
            ],

            [
                'id'    => 6,
                'label' => '6.ทวด'
            ],

            [
                'id'    => 7,
                'label' => '7.ปู่/ย่า/ตา/ยาย'
            ],

            [
                'id'    => 8,
                'label' => '8.ลุง/ป้า/น้า/อา'
            ],

            [
                'id'    => 9,
                'label' => '9.พี่/น้อง'
            ],

            [
                'id'    => 10,
                'label' => '10.หลาน/เหลน'
            ],

            [
                'id'    => 11,
                'label' => '11.ญาติ'
            ],

            [
                'id'    => 12,
                'label' => '12.เพื่อน'
            ]

        ];
    }
}

if (!function_exists('__jobs1_1_11')) {
    function __jobs1_1_11()
    {
        return [
            [
                'id'    => 1,
                'label' => '1.มีชื่อในทะเบียนบ้านและพักอาศัย'
            ],

            [
                'id'    => 2,
                'label' => '2.มีชื่อในทะเบียนบ้านแต่ไม่พักอาศัย'
            ],

            [
                'id'    => 3,
                'label' => '3.ไม่มีชื่อในทะเบียนแต่พักอาศัย'
            ]

        ];
    }
}

if (!function_exists('__jobs1_2_1')) {
    function __jobs1_2_1()
    {
        return [
            [
                'id'    => 1,
                'label' => '1.ว่างงาน'
            ],

            [
                'id'    => 2,
                'label' => '2.เกษตรกรรม (ทำนา) (ระบุ)'
            ],

            [
                'id'    => 3,
                'label' => '3.เกษตรกรรม (ทำไร่) (ระบุ)'
            ],

            [
                'id'    => 4,
                'label' => '4.เกษตรกรรม (ทำสวน) (ระบุ)'
            ],

            [
                'id'    => 5,
                'label' => '5.เกษตรกรรม (ปศุสัตว์) (ระบุ)'
            ],

            [
                'id'    => 6,
                'label' => '6.เกษตรกรรม (เพราะเลี้ยงสัตว์น้ำ) (ระบุ)'
            ],

            [
                'id'    => 7,
                'label' => '7.เกษตรกรรม (ประมง) (ระบุ)'
            ],

            [
                'id'    => 8,
                'label' => '8.เกษตรผสมผสาน (ระบุ)'
            ],

            [
                'id'    => 9,
                'label' => '9.หัตถกรรม (ระบุ)'
            ],
            [
                'id'    => 10,
                'label' => '10.ค้าขาย (ระบุ)'
            ],

            [
                'id'    => 11,
                'label' => '11.รับจ้างทั่วไป/รับจ้างรายวัน(ระบุ)'
            ],

            [
                'id'    => 12,
                'label' => '12.ธุรกิจส่วนตัว (ระบุ)'
            ],

            [
                'id'    => 13,
                'label' => '13.รับราชการ'
            ],

            [
                'id'    => 14,
                'label' => '14.พนักงานของรัฐ'
            ],

            [
                'id'    => 15,
                'label' => '15.พนักงานรัฐวิสาหกิจ'
            ],

            [
                'id'    => 16,
                'label' => '16.พนักงานบริษัท/ธุรกิจเอกชน'
            ],

            [
                'id'    => 17,
                'label' => '17.ไม่มีอาชีพหลัก'
            ],

            [
                'id'    => 18,
                'label' => '18.อื่นๆ (ระบุ)'
            ]

        ];
    }
}

if (!function_exists('__jobs1_2_2')) {
    function __jobs1_2_2()
    {
        return [
            [
                'id'    => 1,
                'label' => '1.ไม่มี'
            ],

            [
                'id'    => 2,
                'label' => '2.เกษตรกรรม (ทำนา) (ระบุ)'
            ],

            [
                'id'    => 3,
                'label' => '3.เกษตรกรรม (ทำไร่) (ระบุ)'
            ],

            [
                'id'    => 4,
                'label' => '4.เกษตรกรรม (ทำสวน) (ระบุ)'
            ],

            [
                'id'    => 5,
                'label' => '5.เกษตรกรรม (ปศุสัตว์) (ระบุ)'
            ],

            [
                'id'    => 6,
                'label' => '6.เกษตรกรรม (เพราะเลี้ยงสัตว์น้ำ) (ระบุ)'
            ],

            [
                'id'    => 7,
                'label' => '7.เกษตรกรรม (ประมง) (ระบุ)'
            ],

            [
                'id'    => 8,
                'label' => '8.เกษตรผสมผสาน (ระบุ)'
            ],

            [
                'id'    => 9,
                'label' => '9.หัตถกรรม (ระบุ)'
            ],
            [
                'id'    => 10,
                'label' => '10.ค้าขาย (ระบุ)'
            ],

            [
                'id'    => 11,
                'label' => '11.รับจ้างทั่วไป/รับจ้างรายวัน(ระบุ)'
            ],

            [
                'id'    => 12,
                'label' => '12.ธุรกิจส่วนตัว (ระบุ)'
            ],

            [
                'id'    => 13,
                'label' => '13.อื่นๆ (ระบุ)'
            ]

        ];
    }
}

if (!function_exists('__jobs1_2_3')) {
    function __jobs1_2_3()
    {
        return [
            [
                'id'    => 1,
                'label' => '1.ไม่มี'
            ],

            [
                'id'    => 2,
                'label' => '2.ทำงานในพื้นที่ตำบล'
            ],

            [
                'id'    => 3,
                'label' => '3.ทำงานอยู่ต่างตำบล'
            ],

            [
                'id'    => 4,
                'label' => '4.ทำงานอยู่ต่างอำเภอ'
            ],

            [
                'id'    => 5,
                'label' => '5.ทำงานอยู่ต่างจังหวัด'
            ],

            [
                'id'    => 6,
                'label' => '6.ทำงานอยู่ต่างประเทศ'
            ]

        ];
    }
}