<?php

if (!function_exists('__jobs6')) {
    function __jobs6()
    {
        return [
            [
                'id'    => 1,
                'label' => '1.ไม่มี'
            ],

            [
                'id'    => 2,
                'label' => '2.บอกต่อ (ปากต่อปาก)'
            ],

            [
                'id'    => 3,
                'label' => '3.ใช้โทรศัพท์มือถือ'
            ],

            [
                'id'    => 4,
                'label' => '4.ใช้โทรศัพท์บ้าน'
            ],

            [
                'id'    => 5,
                'label' => '5.ใช้โทรศัพท์สาธารณะ'
            ],

            [
                'id'    => 6,
                'label' => '6.ใช้คอมพิวเตอร์และอินเทอร์เน็ต'
            ],

            [
                'id'    => 7,
                'label' => '7.ใช้จดหมายอิเล็กทรอนิกส์(Email)'
            ],

            [
                'id'    => 8,
                'label' => '8.การใช้สื่อสังคมออนไลน์(Line)'
            ],

            [
                'id'    => 9,
                'label' => '9.การใช้สื่อสังคมออนไลน์(Facebook)'
            ],
            [
                'id'    => 10,
                'label' => '10.การส่งหนังสือแจ้ง/การส่งจดหมาย'
            ],

            [
                'id'    => 11,
                'label' => '11.ป้ายประกาศ/ป้ายประชาสัมพันธ์'
            ],

            [
                'id'    => 12,
                'label' => '12.เสียงตามสาย/หอกระจายข่าว'
            ],

            [
                'id'    => 13,
                'label' => '13.วิทยุชุมชน'
            ],

            [
                'id'    => 14,
                'label' => '14.เวทีประชุม/ประชาคม'
            ],

            [
                'id'    => 15,
                'label' => '15.อื่นๆ '
            ]

        ];
    }
}
