<?php

if (!function_exists('__jobs5_1')) {
    function __jobs5_1()
    {
        return [

            [
                'id'    => 'ไม่มี',
                'label' => 'ไม่มี'
            ],

            [
                'id'    => 1,
                'label' => '1.ผู้มีสิทธิเลือกตั้งไปใช้สิทธิเลือกตั้งในระดับท้องถิ่นครั้งที่ผ่านมา (ผู้ใหญ่บ้าน ผู้บริหารท้องถิ่น สมาชิกสภาท้องถิ่น)'
            ],

            [
                'id'    => 2,
                'label' => '2.ผู้มีสิทธิเลือกตั้งไปใช้สิทธิเลือกตั้งในระดับชาติครั้งที่ผ่านมา (ส.ส. ส.ว)'
            ],

            [
                'id'    => 3,
                'label' => '3.ร่วมเสนอข้อบัญญัติท้องถิ่น'
            ],

            [
                'id'    => 4,
                'label' => '4.ร่วมเสนอกฎหมายระดับชาติ (พรบ.)'
            ],

            [
                'id'    => 5,
                'label' => '5.ร่วมรณรงค์การเลือกตั้ง'
            ],

            [
                'id'    => 6,
                'label' => '6.ร่วมเป็นกรรมการการเลือกตั้ง'
            ],

            [
                'id'    => 7,
                'label' => '7.ร่วมทำประชาพิจารณ์/ร่วมประชามติ'
            ],

            [
                'id'    => 8,
                'label' => '8.ร่วมทำประชาคม/ร่วมประชามติ'
            ],

            [
                'id'    => 9,
                'label' => '9.ร่วมทำแผนชุมชน/ตำบล'
            ],
            [
                'id'    => 10,
                'label' => '10.ร่วมพัฒนานโยบายสาธารณะ'
            ],

            [
                'id'    => 11,
                'label' => '11.ร่วมกิจกรรมบำเพ็ญประโยชน์ของชุมชน'
            ],

            [
                'id'    => 12,
                'label' => '12.อื่นๆ (ระบุ)..........'
            ]

        ];
    }
}

if (!function_exists('__jobs5_2')) {
    function __jobs5_2()
    {
        return [
            [
                'id'    => 'มี',
                'label' => 'มี'
            ],

            [
                'id'    => 'ไม่มี',
                'label' => 'ไม่มี'
            ]
        ];
    }
}

if (!function_exists('__jobs5_3')) {
    function __jobs5_3()
    {
        return [

        ];
    }
}

// if(!function_exists('__jobs1_1_')){
//     function __jobs1_1_(){
//         return array(

//         );
//     }
// }
