<?php
// ------ เดือน
if (!function_exists('__jobs_m')) {
    function __jobs_m()
    {
        return [
            [
                'id'    => 1,
                'label' => 'ม.ค.'
            ],

            [
                'id'    => 2,
                'label' => 'ก.พ.'
            ],
            [
                'id'    => 3,
                'label' => 'มี.ค.'
            ],
            [
                'id'    => 4,
                'label' => 'เม.ย.'
            ],
            [
                'id'    => 5,
                'label' => 'พ.ค.'
            ],
            [
                'id'    => 6,
                'label' => 'มิ.ย.'
            ],
            [
                'id'    => 7,
                'label' => 'ก.ค.'
            ],
            [
                'id'    => 8,
                'label' => 'ส.ค.'
            ],
            [
                'id'    => 9,
                'label' => 'ก.ย.'
            ],
            [
                'id'    => 10,
                'label' => 'ต.ค.'
            ],
            [
                'id'    => 11,
                'label' => 'พ.ย.'
            ],
            [
                'id'    => 12,
                'label' => 'ธ.ค.'
            ]
        ];
    }
}

// ------ 3_2
if (!function_exists('__jobs_3_2_1')) {
    function __jobs_3_2_1()
    {
        return [
            [
                'id'    => 0,
                'label' => 'ไม่มี'
            ],

            [
                'id'    => 1,
                'label' => 'เป็นของตนเอง'
            ],

            [
                'id'    => 2,
                'label' => 'เช่าที่อยู่อาศัย'
            ],
            [
                'id'    => 3,
                'label' => 'พักอาศัยในพื้นที่สาธารณะ/รกร้าง'
            ]

        ];
    }
}

// ------ 3_2
if (!function_exists('__jobs_3_2_2')) {
    function __jobs_3_2_2()
    {
        return [
            [
                'id'    => 0,
                'label' => 'ไม่มี'
            ],

            [
                'id'    => 1,
                'label' => 'เป็นของตนเอง'
            ],

            [
                'id'    => 2,
                'label' => 'เช่าที่ดินทำกิน'
            ]

        ];
    }
}

// ------ 3_2
if (!function_exists('__jobs_3_2_3')) {
    function __jobs_3_2_3()
    {
        return [
            [
                'id'    => 1,
                'label' => 'พื้นที่บ้านอยู่ที่เดียวกันกับที่ดินทำกิน'
            ],

            [
                'id'    => 2,
                'label' => 'พื้นที่อยู่แยกกับที่ดินทำกิน'
            ],

            [
                'id'    => 3,
                'label' => 'ไม่มี'
            ]

        ];
    }
}
// ------ 3_3
if (!function_exists('__jobs_3_2_3_1')) {
    function __jobs_3_2_3_1()
    {
        return [
            [
                'id'    => 0,
                'label' => 'ไม่มี'
            ],

            [
                'id'    => 1,
                'label' => 'พื้นที่บ้านอยู่ที่เดียวกันกับที่ดินทำกิน'
            ],

            [
                'id'    => 2,
                'label' => 'พื้นที่อยู่แยกกับที่ดินทำกิน'
            ]

        ];
    }
}

// ------ 3_2_4
if (!function_exists('__jobs_3_2_4')) {
    function __jobs_3_2_4()
    {
        return [
            [
                'id'    => 0,
                'label' => 'ไม่มี'
            ],

            [
                'id'    => 1,
                'label' => '1.รถไถ'
            ],

            [
                'id'    => 2,
                'label' => '2.รถไถเดินตาม'
            ],
            [
                'id'    => 3,
                'label' => '3.รถเกี่ยวข้าว'
            ],
            [
                'id'    => 4,
                'label' => '4.รถอีแต๋น'
            ],
            [
                'id'    => 5,
                'label' => '5.รถคีบอ้อย'
            ],
            [
                'id'    => 6,
                'label' => '6.เครื่องสูบน้ำ'
            ],
            [
                'id'    => 7,
                'label' => '7.รถบรรทุกสิบล้อ'
            ],
            [
                'id'    => 8,
                'label' => '8.รถอีแต๊ก/รถอีต๊อก'
            ],
            [
                'id'    => 9,
                'label' => '9.รถบรรทุกหกล้อ'
            ],
            [
                'id'    => 10,
                'label' => '10.รถแบ็คโฮ'
            ],
            [
                'id'    => 11,
                'label' => '11.รถตัก'
            ],
            [
                'id'    => 12,
                'label' => '12.เลื่อยยนต์'
            ],
            [
                'id'    => 13,
                'label' => '13.เครื่องตัดหญ้า'
            ],
            [
                'id'    => 14,
                'label' => '14.ตู้เชื่อม'
            ],
            [
                'id'    => 15,
                'label' => '15.จักรเย็บผ้า'
            ],
            [
                'id'    => 16,
                'label' => '16.กี่ทอผ้า'
            ],
            [
                'id'    => 17,
                'label' => 'อื่นๆ (ระบุ)'
            ]
        ];
    }
}

// ------ 3_2_5
if (!function_exists('__jobs_3_2_5')) {
    function __jobs_3_2_5()
    {
        return [
            [
                'id'    => 0,
                'label' => 'ไม่มี'
            ],

            [
                'id'    => 1,
                'label' => '1.รถยนต์'
            ],

            [
                'id'    => 2,
                'label' => '2.รถจักรยานยนต์'
            ],
            [
                'id'    => 3,
                'label' => '3.รถจักรยาน'
            ],
            [
                'id'    => 4,
                'label' => '4.เรือ'
            ],
            [
                'id'    => 5,
                'label' => '5.อื่นๆ (ระบุ)'
            ]
        ];
    }
}

// ------ 3_2_6
if (!function_exists('__jobs_3_2_6')) {
    function __jobs_3_2_6()
    {
        return [
            [
                'id'    => 0,
                'label' => 'ไม่มี'
            ],

            [
                'id'    => 1,
                'label' => '1.โทรศัพท์มือถือ'
            ],

            [
                'id'    => 2,
                'label' => '2.โทรศัพท์บ้าน'
            ],
            [
                'id'    => 3,
                'label' => '3.เครื่องคอมพิวเตอร์ /Ipad/Tablet'
            ],
            [
                'id'    => 4,
                'label' => '4.ระบบอินเตอร์เน็ตในบ้าน'
            ],
            [
                'id'    => 5,
                'label' => '5.อื่นๆ (ระบุ)'
            ]
        ];
    }
}

// ------ 3_2_7
if (!function_exists('__jobs_3_2_7')) {
    function __jobs_3_2_7()
    {
        return [
            [
                'id'    => 0,
                'label' => 'ไม่มี'
            ],

            [
                'id'    => 1,
                'label' => '1.หมา'
            ],

            [
                'id'    => 2,
                'label' => '2.แมว'
            ],
            [
                'id'    => 3,
                'label' => '3.วัว'
            ],
            [
                'id'    => 4,
                'label' => '4.ควาย'
            ],
            [
                'id'    => 5,
                'label' => '5.ช้าง'
            ],
            [
                'id'    => 6,
                'label' => '6.ม้า'
            ],
            [
                'id'    => 7,
                'label' => '7.อื่นๆ (ระบุ)'
            ]
        ];
    }
}

// ------ 3_2_7
if (!function_exists('__jobs_3_3_1')) {
    function __jobs_3_3_1()
    {
        return [
            [
                'id'    => 0,
                'label' => 'ไม่มี'
            ],

            [
                'id'    => 1,
                'label' => '1.การทำการเกษตร'
            ],

            [
                'id'    => 2,
                'label' => '2.การศึกษาบุตร'
            ],
            [
                'id'    => 3,
                'label' => '3.ซื้อยานพาหนะ'
            ],
            [
                'id'    => 4,
                'label' => '4.ซื้อสิ่งอำนวยความสะดวก เช่นเครื่องใช้ไฟฟ้า'
            ],
            [
                'id'    => 5,
                'label' => '5.ซื้อโทรศัพท์มือถือ'
            ],
            [
                'id'    => 6,
                'label' => '6.ซื้อสังหาริมทรัพย์/สร้างบ้าน/ซื้อที่ดินทำกิน'
            ],
            [
                'id'    => 7,
                'label' => '7.การเจ็บป่วย'
            ],
            [
                'id'    => 8,
                'label' => '8.ค่าใช้จ่ายด้านอาหาร'
            ],

            [
                'id'    => 9,
                'label' => '9.ลงทุนในการทำธุรกิจ'
            ],
            [
                'id'    => 10,
                'label' => '10.การเล่นหวยหรือการพนัน'
            ],
            [
                'id'    => 11,
                'label' => '11.ส่งสมาชิกในครัวเรือนไปต่างประเทศ'
            ],
            [
                'id'    => 12,
                'label' => '12.อื่นๆ (ระบุ)'
            ]
        ];
    }
}

// ------ 3_3_2_1
if (!function_exists('__jobs_3_3_2_1')) {
    function __jobs_3_3_2_1()
    {
        return [
            [
                'id'    => 0,
                'label' => 'ไม่มี'
            ],

            [
                'id'    => 1,
                'label' => '1.ธนาคารเพื่อการเกษตรและสหกรณ์การเกษตร (ธกส.)'
            ],

            [
                'id'    => 2,
                'label' => '2.ธนาคารออมสิน'
            ],
            [
                'id'    => 3,
                'label' => '3.ธนาคารสงเคราะห์'
            ],
            [
                'id'    => 4,
                'label' => '4.ธนาคารพัฒนาวิสาหกิจขนาดกลางและขนาดย่อมแห่งประเทศไทย'
            ],
            [
                'id'    => 5,
                'label' => '5.ธนาคารอิสลามแห่งประเทศไทย'
            ]
        ];
    }
}

// ------ 3_3_2_2
if (!function_exists('__jobs_3_3_2_2')) {
    function __jobs_3_3_2_2()
    {
        return [
            [
                'id'    => 0,
                'label' => 'ไม่มี'
            ],

            [
                'id'    => 1,
                'label' => '1.ธนาคารกรุงไทย'
            ],

            [
                'id'    => 2,
                'label' => '2.ธนาคารกรุงเทพ'
            ],
            [
                'id'    => 3,
                'label' => '3.ธนาคารกสิกรไทย'
            ],
            [
                'id'    => 4,
                'label' => '4.ธนาคารไทยพาณิชย์'
            ],
            [
                'id'    => 5,
                'label' => '5.ธนาคารกรุงศรีอยุธยา'
            ],
            [
                'id'    => 6,
                'label' => '6.ธนาคารทหารไทย'
            ],
            [
                'id'    => 7,
                'label' => '7.ธนาคารธนชาติ'
            ],
            [
                'id'    => 8,
                'label' => '8.อื่นๆ (ระบุ)…..'
            ]
        ];
    }
}

// ------ 3_3_2_3
if (!function_exists('__jobs_3_3_2_3')) {
    function __jobs_3_3_2_3()
    {
        return [
            [
                'id'    => 0,
                'label' => 'ไม่มี'
            ],

            [
                'id'    => 1,
                'label' => '1..สหกรณ์ (ระบุ)'
            ],

            [
                'id'    => 2,
                'label' => '2.เครติดยูเนี่ยน'
            ],
            [
                'id'    => 3,
                'label' => '3.อื่นๆ (ระบุ)'
            ]
        ];
    }
}

// ------ 3_3_2_4
if (!function_exists('__jobs_3_3_2_4')) {
    function __jobs_3_3_2_4()
    {
        return [
            [
                'id'    => 0,
                'label' => 'ไม่มี'
            ],

            [
                'id'    => 1,
                'label' => '1.โครงการ กข.คจ.'
            ],

            [
                'id'    => 2,
                'label' => '2.โครงการเศรษฐกิจชุมชน'
            ],
            [
                'id'    => 3,
                'label' => '3.กลุ่มออมทรัพย์'
            ],
            [
                'id'    => 4,
                'label' => '4.กลุ่มสัจจะสะสมทรัพย์'
            ],
            [
                'id'    => 5,
                'label' => '5.กองทุนแม่ของแผ่นดิน'
            ],
            [
                'id'    => 6,
                'label' => '6.ธนาคารหมู่บ้าน'
            ],
            [
                'id'    => 7,
                'label' => '7.สถาบันการเงินชุมชน'
            ],
            [
                'id'    => 8,
                'label' => '8.กองทุนหมู่บ้าน'
            ],
            [
                'id'    => 9,
                'label' => '9.กลุ่มออมทรัพย์เพื่อการผลิต'
            ],
            [
                'id'    => 10,
                'label' => '10.อื่นๆ (ระบุ)'
            ]
        ];
    }
}

// ------ 3_3_2_5
if (!function_exists('__jobs_3_3_2_5')) {
    function __jobs_3_3_2_5()
    {
        return [
            [
                'id'    => 0,
                'label' => 'ไม่มี'
            ],

            [
                'id'    => 1,
                'label' => '1.กลุ่มบุคคลที่ปล่อยเงินกู้ดอกเบี้ยสูงกว่าที่กฎหมายกำหนดนายทุน'
            ],

            [
                'id'    => 2,
                'label' => '2.ญาติพี่น้อง'
            ]
        ];
    }
}

// ------ 3_3_3
if (!function_exists('__jobs_3_3_3')) {
    function __jobs_3_3_3()
    {
        return [
            [
                'id'    => 0,
                'label' => 'ไม่มี'
            ],

            [
                'id'    => 1,
                'label' => '1.กลุ่มออมทรัพย์'
            ],

            [
                'id'    => 2,
                'label' => '2.กลุ่มสัจจะสะสมทรัพย์'
            ],
            [
                'id'    => 3,
                'label' => '3.กองทุนแม่ของแผ่นดิน'
            ],
            [
                'id'    => 4,
                'label' => '4.กองทุนหมู่บ้าน'
            ],
            [
                'id'    => 5,
                'label' => '5.สถาบันการเงินชุมชน'
            ],
            [
                'id'    => 6,
                'label' => '6.สหกรณ์ (ระบุ)........'
            ],
            [
                'id'    => 7,
                'label' => '7.ธนาคารหมู่บ้าน'
            ],
            [
                'id'    => 8,
                'label' => '8.ธนาคารเพื่อการเกษตรและสหกรณ์การเกษตร (ธกส.)'
            ],
            [
                'id'    => 9,
                'label' => '9.ธนาคารออมสิน/สลากออมสิน'
            ],
            [
                'id'    => 10,
                'label' => '10.ธนาคารพาณิชย์'
            ],
            [
                'id'    => 11,
                'label' => '11.พันธบัตรรัฐบาล'
            ],

            [
                'id'    => 12,
                'label' => '12.ประกันชีวิตแบบออม'
            ],
            [
                'id'    => 13,
                'label' => '13.ทองคำเพชรเครื่องประดับ'
            ],
            [
                'id'    => 14,
                'label' => '14.หุ้น'
            ],
            [
                'id'    => 15,
                'label' => '15.อื่นๆ (ระบุ)…….'
            ]
        ];
    }
}

// ------ 3_3_4_1
if (!function_exists('__jobs_3_3_4_1')) {
    function __jobs_3_3_4_1()
    {
        return [
            [
                'id'    => 0,
                'label' => 'ไม่มี'
            ],

            [
                'id'    => 1,
                'label' => '1.ขาดเทคนิค วิธีการในการสร้างงาน/รายได้/อาชีพ'
            ],

            [
                'id'    => 2,
                'label' => '2.ไม่มีที่ดินทำกินเป็นของตนเอง'
            ],
            [
                'id'    => 3,
                'label' => '3.ไม่สามารถกู้เงินมาลงทุนได้'
            ],
            [
                'id'    => 4,
                'label' => '4.ไม่มีเครื่องมือ/เครื่องจักร ในการประกอบอาชีพ'
            ],
            [
                'id'    => 5,
                'label' => '5.ไม่มีช่องทางและตลาดสำหรับจำหน่ายสินค้า'
            ],
            [
                'id'    => 6,
                'label' => '6.ไม่สามารถเข้าถึงแหล่ง'
            ],
            [
                'id'    => 7,
                'label' => '7.อื่นๆ (ระบุ)........'
            ]
        ];
    }
}

// ------ 3_3_4_2
if (!function_exists('__jobs_3_3_4_2')) {
    function __jobs_3_3_4_2()
    {
        return [
            [
                'id'    => 0,
                'label' => 'ไม่มี'
            ],

            [
                'id'    => 1,
                'label' => '1.ไม่มีที่อยู่อาศัยเป็นของตนเอง'
            ],

            [
                'id'    => 2,
                'label' => '2.ขาดความรู้'
            ],
            [
                'id'    => 3,
                'label' => '3.ไม่สามารถใช้ประโยชน์จากพื้นที่สาธารณะ'
            ],
            [
                'id'    => 4,
                'label' => '4.มีรายรับน้อยกว่ารายจ่าย'
            ],
            [
                'id'    => 5,
                'label' => '5.อื่นๆ(ระบุ)'
            ]
        ];
    }
}
