<?php
if (!function_exists('__jobs_2_1')) {
    function __jobs_2_1()
    {
        return [
            [
                'id'    => 1,
                'label' => '1.ไม่มี'
            ],

            [
                'id'    => 2,
                'label' => '2.ดื่มสุราเป็นประจำ (มีการดื่มเหล้า เบียร์ ไวน์แชมเปญ น้ำตาลเมา กระแช่ สาโท สุรา หมัก พื้นบ้าน ในทุกสัปดาห์)'
            ],

            [
                'id'    => 3,
                'label' => '3.ดื่มสุราแล้วขับขี่ยานพาหนะ'
            ],

            [
                'id'    => 4,
                'label' => '4.ขับรถเร็วเกินกว่าที่กฎหมายกำหนด'
            ],

            [
                'id'    => 5,
                'label' => '5.ขับขี่รถยนต์โดยไม่คาดเข็มนิรภัย'
            ],

            [
                'id'    => 6,
                'label' => '6.ขับขี่รถจักรยานยนต์โดยไม่สวมหมวกนิรภัย'
            ],

            [
                'id'    => 7,
                'label' => '7.สูบบุหรี่เป็นประจำ (มีการสูบบุหรี่ในทุกวัน)'
            ],

            [
                'id'    => 8,
                'label' => '8.อยู่ในสถานที่ที่มีผู้สูบบุหรี่ หรือมีโอกาสได้รับควันบุหรี่เป็นประจำในทุกวัน'
            ],

            [
                'id'    => 9,
                'label' => '9.ไม่ได้ออกกำลังกาย'
            ],
            [
                'id'    => 10,
                'label' => '10.ไม่ได้ตรวจสุขภาพประจำปี'
            ],
            [
                'id'    => 11,
                'label' => '11.มีความเครียด'
            ],
            [
                'id'    => 12,
                'label' => '12.ทำงานหนัก พักผ่อนน้อย'
            ],
            [
                'id'    => 13,
                'label' => '13.กินอาหารรสจัด'
            ],
            [
                'id'    => 14,
                'label' => '14.กินอาหารสุกๆ ดิบๆ'
            ],
            [
                'id'    => 15,
                'label' => '15.การใช้ยาชุด ยาแก้ปวด ยาลูกกลอน เป็นประจำ'
            ],
            [
                'id'    => 16,
                'label' => '16.การใช้สารเสพติด (สาระเหย กัญชา ยาบ้า เฮโรอีน)'
            ],
            [
                'id'    => 17,
                'label' => '17.มีเพศสัมพันธ์ที่ไม่ปลอดภัย'
            ]
        ];
    }
}

// ------------- 2.2

if (!function_exists('__jobs_2_2')) {
    function __jobs_2_2()
    {
        return [
            [
                'id'    => 1,
                'label' => '1.ไม่มี'
            ],

            [
                'id'    => 2,
                'label' => '2.ใช้สารเคมีในการเกษตรโดยป้องกันตนเองไม่เหมาะสม'
            ],

            [
                'id'    => 3,
                'label' => '3.ทำงานในบริเวณที่มีการสูดดมสารเคมี สารระเหยที่เป็นอันตรายต่อสุขภาพ'
            ],

            [
                'id'    => 4,
                'label' => '4.ทำงานในบริเวณที่มีเสียงดัง'
            ],

            [
                'id'    => 5,
                'label' => '5.ทำงานในบริเวณที่มีฝุ่นละออง/ควัน'
            ],

            [
                'id'    => 6,
                'label' => '6.ขาดความรู้ หรือไม่ตระหนักในเรื่องความปลอดภัย'
            ],

            [
                'id'    => 7,
                'label' => '7.การใช้เครื่องมือ เครื่องจักรโดยไม่มีอุปกรณ์ป้องกันอันตราย'
            ],

            [
                'id'    => 8,
                'label' => '8.ทำงานในลักษณะยืน หรือนั่งในเดิมนานๆ หรือในท่าที่ไม่เหมาะสม'
            ],

            [
                'id'    => 9,
                'label' => '9.ทำงานในบริเวณที่มีอากาศร้อนอบอ้าวหรืออากาศเย็นมากเกินปกติ'
            ],
            [
                'id'    => 10,
                'label' => '10.ทำงานในที่สูง'
            ]

        ];
    }
}

// ------2.3
if (!function_exists('__jobs_2_3')) {
    function __jobs_2_3()
    {
        return [
            [
                'id'    => 1,
                'label' => '1.ไม่มี'
            ],

            [
                'id'    => 2,
                'label' => '2.เด็กแรกเกิดที่มีน้ำหนักน้อยกว่า 2,500 กรัม'
            ],
            [
                'id'    => 3,
                'label' => '3.เด็กแรกเกิดถึง 6 เดือน ที่ไม่ได้กินนมแม่อย่างเดียว'
            ],
            [
                'id'    => 4,
                'label' => '4.เด็กแรกเกิดถึง 5 ปี ที่มีพัฒนาการที่ล่าช้า'
            ],
            [
                'id'    => 5,
                'label' => '5.เด็กอายุน้อยกว่า 12 ปีที่ได้รับวัคซีนป้อนกันโรคไม่ครบ'
            ],
            [
                'id'    => 6,
                'label' => '6.ผู้สูงอายุ'
            ],
            [
                'id'    => 7,
                'label' => '7.ผู้ที่มีภาวะขาดสารอาหาร'
            ],
            [
                'id'    => 8,
                'label' => '8.ผู้พิการทางกาย/การเคลื่อนไหว'
            ],
            [
                'id'    => 9,
                'label' => '9.ผู้พิการทางการมองเห็น'
            ],
            [
                'id'    => 10,
                'label' => '10.ผู้พิการทางการได้ยิน/สื่อความหมาย'
            ],
            [
                'id'    => 11,
                'label' => '11.ผู้พิการทางจิต/พฤติกรรม'
            ],
            [
                'id'    => 12,
                'label' => '12.ผู้พิการทางจิต/พฤติกรรม'
            ],
            [
                'id'    => 13,
                'label' => '13.ผู้ติดยาเสพติด'
            ],
            [
                'id'    => 14,
                'label' => '14.ผู้ป่วยเอดส์/ผู้ติดเชื้อ HIV'
            ],
            [
                'id'    => 15,
                'label' => '15.ผู้ป่วยอัลไซเมอร์'
            ],
            [
                'id'    => 16,
                'label' => '16.ผู้ป่วยเรื้อรัง'
            ],
            [
                'id'    => 17,
                'label' => '17.หญิงตั้งครรภ์'
            ],
            [
                'id'    => 18,
                'label' => '18.ผู้ติดเชื้อวัณโรค'
            ],
            [
                'id'    => 19,
                'label' => '19.ผู้ด้อยโอกาส (ไม่มีบัตรประชาชน,เข้าไม่ถึงสิทธิในการรักษา,ขาดสวัสดิการ)'
            ],
            [
                'id'    => 20,
                'label' => '20.ผู้ป่วยระยะสุดท้าย'
            ]
        ];
    }
}

// ------2.4
if (!function_exists('__jobs_2_4')) {
    function __jobs_2_4()
    {
        return [
            [
                'id'    => 1,
                'label' => '1.ไม่มี'
            ],

            [
                'id'    => 2,
                'label' => '2.ไข้สูงและมีอาการชัก'
            ],
            [
                'id'    => 3,
                'label' => '3.หอบเหนื่อย'
            ],
            [
                'id'    => 4,
                'label' => '4.เหนื่อย อ่อนเพลีย ไม่มีแรง'
            ],
            [
                'id'    => 5,
                'label' => '5.หมดสติ'
            ],
            [
                'id'    => 6,
                'label' => '6.บาดเจ็บจากอุบัติเหตุจราจร'
            ],
            [
                'id'    => 7,
                'label' => '7.บาดเจ็บจากการทำงาน เช่น ตกจากที่สูง ของหล่นทับ เป็นต้น'
            ],
            [
                'id'    => 8,
                'label' => '8.บาดเจ็บจากการถูกสัตว์ทำร้าย เช่น สุนัขกัด งูกัด เป็นต้น'
            ],
            [
                'id'    => 9,
                'label' => '9.บาดเจ็บจากเหตุอื่นๆ เช่นหกล้ม ถูกของมีคมบาด ถูกของหนักหล่นทับ ถูกทำร้ายร่างกาย เป็นต้น'
            ]
        ];
    }
}

// ------2.5
// ------2.5.1
if (!function_exists('__jobs_2_5_1')) {
    function __jobs_2_5_1()
    {
        return [
            [
                'id'    => 1,
                'label' => '1.ไม่มี (ข้ามไปตอบข้อต่อไป)'
            ],

            [
                'id'    => 2,
                'label' => '2.หอบหืด'
            ],
            [
                'id'    => 3,
                'label' => '3.ทางเดินหายใจอุดตันเรื้อรัง'
            ],
            [
                'id'    => 4,
                'label' => '4.ถุงลมโป่งพอง'
            ],
            [
                'id'    => 5,
                'label' => '5.พิษสุราเรื้อรัง'
            ],
            [
                'id'    => 6,
                'label' => '6.โรงติดเชื้อ (วัณโรค)'
            ],
            [
                'id'    => 7,
                'label' => '7.กลุ่มโรคเกี่ยวกับเนื้ออกมะเร็ง'
            ],
            [
                'id'    => 8,
                'label' => '8.กลุ่มโรงหัวใจ'
            ],
            [
                'id'    => 9,
                'label' => '9.กลุ่มโรคความดันโลหิต'
            ],
            [
                'id'    => 10,
                'label' => '10.กลุ่มโรคหลอดเลือดสมอง'
            ],
            [
                'id'    => 11,
                'label' => '11.กลุ่มโรคโลหิต'
            ],
            [
                'id'    => 12,
                'label' => '12.กลุ่มโรคตับ'
            ],
            [
                'id'    => 13,
                'label' => '13.กลุ่มโรคไต'
            ],
            [
                'id'    => 14,
                'label' => '14.กลุ่มโรคทางเดินปัสสาวะ'
            ],
            [
                'id'    => 15,
                'label' => '15.กลุ่มโรคกระดูก กล้ามเนื้อและข้อ'
            ],
            [
                'id'    => 16,
                'label' => '16.กลุ่มโรงกระดูกกล้ามเนื้อและข้อ'
            ],
            [
                'id'    => 17,
                'label' => '17.โรคไขมันในเลือด'
            ],
            [
                'id'    => 18,
                'label' => '18.โรคอ้วน'
            ],
            [
                'id'    => 19,
                'label' => '19.โรคระบบต่อมไร้ท่อ (ไทรอยด์)'
            ],
            [
                'id'    => 20,
                'label' => '20.โรคจิตเวช / ซึมเศร้า'
            ],
            [
                'id'    => 21,
                'label' => '21.โรคเกี่ยวกับระบบทางเดินอาหาร'
            ],
            [
                'id'    => 22,
                'label' => '22.โรคภูมิคุ้มกันบกพร่อง (HIV)'
            ],
            [
                'id'    => 23,
                'label' => '23.โรคภูมิแพ้'
            ],
            [
                'id'    => 24,
                'label' => '24.อื่นๆ (ระบุ)'
            ]
        ];
    }
}

// ------2.5.2
if (!function_exists('__jobs_2_5_2')) {
    function __jobs_2_5_2()
    {
        return [
            [
                'id'    => 1,
                'label' => '1.ไม่มี'
            ],

            [
                'id'    => 2,
                'label' => '2.ดูแลตัวเอง'
            ],
            [
                'id'    => 3,
                'label' => '3.สมาชิกในครอบครัว'
            ],
            [
                'id'    => 4,
                'label' => '4.อสม.'
            ],
            [
                'id'    => 5,
                'label' => '5.พยาบาล'
            ],
            [
                'id'    => 6,
                'label' => '6.แพทย์'
            ],
            [
                'id'    => 7,
                'label' => '7.พระสงฆ์/ผู้นำศาสนา'
            ],
            [
                'id'    => 8,
                'label' => '8.หมอพื้นบ้าน/หมอสมุนไพร'
            ],
            [
                'id'    => 9,
                'label' => '9.หมอครอบครัว'
            ],
            [
                'id'    => 10,
                'label' => '10.อาสาสมัครอื่นๆ (ระบุ)'
            ],
            [
                'id'    => 11,
                'label' => '11.กลุ่ม/ชมรม (ระบุ)'
            ],
            [
                'id'    => 12,
                'label' => '12.อื่นๆ (ระบุ)'
            ]
        ];
    }
}

// ------2.5.3
if (!function_exists('__jobs_2_5_3')) {
    function __jobs_2_5_3()
    {
        return [
            [
                'id'    => 1,
                'label' => '1.ไม่มี'
            ],

            [
                'id'    => 2,
                'label' => '2.กินยา'
            ],
            [
                'id'    => 3,
                'label' => '3.ฉีดยา'
            ],
            [
                'id'    => 4,
                'label' => '4.การใช้สมุนไพร.'
            ],
            [
                'id'    => 5,
                'label' => '5.การดูแลด้านอาหาร'
            ],
            [
                'id'    => 6,
                'label' => '6.การทำกายภาพบำบัด'
            ],
            [
                'id'    => 7,
                'label' => '7.การเฝ้าระวังอาการผิดปกติของร่างกาย'
            ],
            [
                'id'    => 8,
                'label' => '8.พาไปรักษาที่โรงพยาบาล/รถบริการสุขภาพ'
            ],
            [
                'id'    => 9,
                'label' => '9.อื่นๆ (ระบุ)'
            ]

        ];
    }
}

// ------2.6
// ------2.6.1
if (!function_exists('__jobs_2_6_1')) {
    function __jobs_2_6_1()
    {
        return [
            [
                'id'    => 1,
                'label' => '1.ไม่มี (ข้ามไปตอบข้อต่อไป)'
            ],

            [
                'id'    => 2,
                'label' => '2.การกินยา'
            ],
            [
                'id'    => 3,
                'label' => '3.การฉีดยา'
            ],
            [
                'id'    => 4,
                'label' => '4.การไปรับการรักษาไม่ต่อเนื่อง.'
            ],
            [
                'id'    => 5,
                'label' => '5.การปฏิบัติตัวในการดูแลสุขภาพไม่เหมาะสม'
            ],
            [
                'id'    => 6,
                'label' => '6.การเดินทางไปรับการรักษาไม่สะดวก'
            ],
            [
                'id'    => 7,
                'label' => '7.การไม่มีผู้ดูแลช่วยเหลือ เมื่ออยู่ตามลำพัง'
            ],
            [
                'id'    => 8,
                'label' => '8.การไม่มีทุนทรัพย์เพียงพอสำหรับการรักษา'
            ],
            [
                'id'    => 9,
                'label' => '9.อื่นๆ (ระบุ)'
            ]

        ];
    }
}

// ------2.6.2
if (!function_exists('__jobs_2_6_2')) {
    function __jobs_2_6_2()
    {
        return [
            [
                'id'    => 1,
                'label' => '1.ไม่มี'
            ],

            [
                'id'    => 2,
                'label' => '2.ป่วย ไปไหนมาไหนได้'
            ],
            [
                'id'    => 3,
                'label' => '3.ป่วย อยู่บ้าน ไปไหนมาไหนไม่ได้'
            ],
            [
                'id'    => 4,
                'label' => '4.ป่วย นอนติดเตียง.'
            ]
        ];
    }
}

// ------2.7
// ------2.7.1
if (!function_exists('__jobs_2_7_1')) {
    function __jobs_2_7_1()
    {
        return [
            [
                'id'    => 1,
                'label' => '1.ไม่มี (ข้ามไปส่วนที่ 3 )'
            ],

            [
                'id'    => 2.1,
                'label' => '2.สิทธิตามระบบหลักประกันสุขภาพของรัฐ (บัตรทอง (30))'
            ],
            [
                'id'    => 2.2,
                'label' => '3.สิทธิตามระบบหลักประกันสุขภาพของรัฐ (ประกันสังคม)'
            ],
            [
                'id'    => 2.3,
                'label' => '4.สิทธิตามระบบหลักประกันสุขภาพของรัฐ (สวัสดิการข้าราชการ).'
            ],
            [
                'id'    => 3.1,
                'label' => '5.สิทธิเฉพาะอื่น (สวัสดิการขององค์การปกครองส่วนท้องถิ่น)'
            ],
            [
                'id'    => 3.2,
                'label' => '6.สิทธิเฉพาะอื่น (สวัสดิการพนังงานรัฐวิสาหกิจ)'
            ],
            [
                'id'    => 3.3,
                'label' => '7.สิทธิเฉพาะอื่น (สิทธิแรงงานต่างด้าว)'
            ],
            [
                'id'    => 3.4,
                'label' => '8.สิทธิเฉพาะอื่น (สวัสดิการที่รัฐจัดให้สำหรับกลุ่มเฉพาะ เช่น ทหารผ่านศึก)'
            ],
            [
                'id'    => 3.5,
                'label' => '9.สิทธิเฉพาะอื่น (สวัสดิการขององค์กรอิสระของรัฐ)'
            ],
            [
                'id'    => 4,
                'label' => '10.ใช้สิทธิประกันสุขภาพเอกชน'
            ],
            [
                'id'    => 5,
                'label' => '11.สวัสดิการที่จัดโดยชุมชน'
            ]

        ];
    }
}

// ------2.7.2
if (!function_exists('__jobs_2_7_2')) {
    function __jobs_2_7_2()
    {
        return [
            [
                'id'    => 1,
                'label' => '1.ไม่มี'
            ],

            [
                'id'    => 2,
                'label' => '2.จ่ายเอง'
            ],
            [
                'id'    => 3,
                'label' => '3.ใช้สิทธิตามระบบหลักประกันสุขภาพของรัฐ'
            ],
            [
                'id'    => 4,
                'label' => '4.ใช้สิทธิเฉพาะอื่น.'
            ],
            [
                'id'    => 5,
                'label' => '5.ใช้สิทธิประกันสุขภาพเอกชน'
            ],
            [
                'id'    => 6,
                'label' => '6.ใช้สิทธิสวัสดิการที่จัดโดยชุมชน'
            ]
        ];
    }
}

// ------2.7.2
if (!function_exists('__jobs_3_1')) {
    function __jobs_3_1()
    {
        return [
            [
                'id'    => 1,
                'label' => 'เงินเดือน/ค่าจ้าง'
            ],

            [
                'id'    => 2,
                'label' => 'รายรับจากการทำการเกษตร'
            ],
            [
                'id'    => 3,
                'label' => 'รายได้จากการประกอบธุรกิจ/ค้าขาย'
            ],
            [
                'id'    => 4,
                'label' => 'รายได้จากทรัพย์สิน'
            ],
            [
                'id'    => 5,
                'label' => 'รายได้จากแหล่งอื่นๆ'
            ]
        ];
    }
}
