<?php

if (!function_exists('__jobs4_1')) {
    function __jobs4_1()
    {
        return [
            [
                'id'    => 'ไม่มี',
                'label' => 'ไม่มี'
            ],

            [
                'id'    => 1,
                'label' => '1.มีการจัดบ้านให้อากาศถ่ายเทได้สะสวก ไม่อับชื้นไม่อบอ้าว'
            ],

            [
                'id'    => 2,
                'label' => '2.มีแสงสว่างส่องถึงภายในบ้านได้อย่างเพียงพอ'
            ]

        ];
    }
}

if (!function_exists('__jobs4_2')) {
    function __jobs4_2()
    {
        return [
            [
                'id'    => 'ไม่มี',
                'label' => 'ไม่มี'
            ],

            [
                'id'    => 1,
                'label' => '1.มีการทำความสะอาดภายในบ้าน จัดให้เป็นสัดส่วน เป็นระเบียบอย่างสม่ำเสมอ'
            ],

            [
                'id'    => 2,
                'label' => '2.กรณีที่มีการเลี้ยงสัตว์ในบ้านมีการแยกเป็นสัดส่วนและมีการทำความสะอาดอย่างสม่ำเสมอ'
            ]

        ];
    }
}

if (!function_exists('__jobs4_3')) {
    function __jobs4_3()
    {
        return [
            [
                'id'    => 'ไม่มี',
                'label' => 'ไม่มี'
            ],

            [
                'id'    => 1,
                'label' => '1.มีการดูแลและซ่อมแซมตัวบ้านให้อยู่สภาพดีมั่นคง แข็งแรง'
            ],

            [
                'id'    => 2,
                'label' => '2.มีการจัดเก็บ บำรุงรักษาและตรวจสอบความปลอดภัยของสายไฟ ปลั๊ก ไฟ และอุปกรณ์ไฟฟ้าทุกชนิด ให้อยู่ในสภาพดี'
            ],

            [
                'id'    => 3,
                'label' => '3.มีการจัดทำทางลาดเอียงเพื่อใช้แทนการเดินขึ้นลงบันได'
            ],

            [
                'id'    => 4,
                'label' => '4.มีการจัดทำราวในการเกาะยึดหรือจับในบริเวณบ้าน'
            ]

        ];
    }
}

if (!function_exists('__jobs4_4')) {
    function __jobs4_4()
    {
        return [
            [
                'id'    => 'ไม่มี',
                'label' => 'ไม่มี'
            ],

            [
                'id'    => 1,
                'label' => '1.การจักการให้มีภาชนะรองรับขยะ'
            ],

            [
                'id'    => 2,
                'label' => '2.การใช้บริการเก็บขยะในพื้นที่ (ชุมชน เอกชน หรือบริการสาธารณะโดยรัฐ)'
            ],

            [
                'id'    => 3,
                'label' => '3.การนำขยะไปทิ้งที่อื่น(ที่ทำงาน นอกพื้นที่บ้านที่ทิ้งขยะในชุมชน)'
            ],

            [
                'id'    => 4,
                'label' => '4.การฝัง'
            ],

            [
                'id'    => 5,
                'label' => '5.การเผา'
            ],

            [
                'id'    => 6,
                'label' => '6.การทำปุ๋ยหมัก'
            ],

            [
                'id'    => 7,
                'label' => '7.การทำน้ำหมัก	'
            ],

            [
                'id'    => 8,
                'label' => '8.การคัดแยกขยะ'
            ],

            [
                'id'    => 9,
                'label' => '9.งดการใช้ถุงพลาสติกโฟม และวัสดุที่ทำให้เกิดขยะ โดยใช้สิ่งอื่นทดแทน (ถุงผ้า ปิ่นโต ใบตองเพื่อบรรจุอาหาร)'
            ],
            [
                'id'    => 10,
                'label' => '10.ลดการใช้ถุงพลาสติก โฟม และวัสดุที่ทำให้เกิดขยะ'
            ],

            [
                'id'    => 11,
                'label' => '11.การใช้ซ้ำ'
            ],

            [
                'id'    => 12,
                'label' => '12.การแปรรูปใช้ใหม่'
            ]

        ];
    }
}

if (!function_exists('__jobs4_5')) {
    function __jobs4_5()
    {
        return [
            [
                'id'    => 'ไม่มี',
                'label' => 'ไม่มี'
            ],

            [
                'id'    => 1,
                'label' => '1.มีการทำความสะอาดบริเวณรอบบ้านให้สะอาด'
            ],

            [
                'id'    => 2,
                'label' => '2.มีการปรับสภาพภูมิทัศน์บริเวณรอบบ้าน'
            ],

            [
                'id'    => 3,
                'label' => '3.มีการกำจัดแหล่งเพาะพันธุ์ยุงลาย เช่น คว่ำ กะลา กระป๋อง หรือภาชนะที่อาจมีน้ำขังได้'
            ],

            [
                'id'    => 4,
                'label' => '4.อื่นๆ (ระบุ)…………'
            ]

        ];
    }
}

if (!function_exists('__jobs4_6')) {
    function __jobs4_6()
    {
        return [
            [
                'id'    => 'ไม่มี',
                'label' => 'ไม่มี'
            ],

            [
                'id'    => 1,
                'label' => '1.กรณีบ้านอยู่ใกล้แหล่งน้ำหรือมีท่อระบายน้ำเชื่อมกับรางระบายน้ำสาธารณะมีการดักเศษขยะ เศษอาหาร ก่อนปล่อยสู่รางระบายน้ำสาธารณะ'
            ],

            [
                'id'    => 2,
                'label' => '2.กรณีอยู่ห่างจากแหล่งน้ำและไม่มีท่อระบายน้ำเชื่อมกับรางระบายน้ำสาธารณะมีการดักเศษขยะ เศษอาหาร ก่อนปล่อยน้ำซึมลงผิวดิน และไม่มีน้ำขัง'
            ],

            [
                'id'    => 3,
                'label' => '3.มีการใช้วัสดุหรืออุปกรณ์ป้องกันการเกิดควันหรือฝุ่นละออง'
            ],

            [
                'id'    => 4,
                'label' => '4.มีการใช้วัสดุหรืออุปกรณ์ป้องกันการเกิดเสียงดังรบกวน'
            ],

            [
                'id'    => 5,
                'label' => '5.มีการใช้วัสดุหรืออุปกรณ์ป้องกันอันตรายจากการใช้สารเคมี'
            ],

            [
                'id'    => 6,
                'label' => '6.มีการทำป้ายเตือนสารเคมีตามประเภท'
            ],

            [
                'id'    => 7,
                'label' => '7.มีการจัดเก็บสารเคมีที่เป็นอันตรายให้มิดชิด แยกเป็นสัดส่วน และพ้นมือเด็ก'
            ],

            [
                'id'    => 8,
                'label' => '8.มีการทำเกษตรอินทรีย์และลดปริมาณการใช้สารเคมี'
            ]

        ];
    }
}

if (!function_exists('__jobs4_7')) {
    function __jobs4_7()
    {
        return [
            [
                'id'    => 'ไม่มี',
                'label' => 'ไม่มี'
            ],

            [
                'id'    => 1,
                'label' => '1.มีน้ำอุปโภค บริโภค ที่สะอาด เพียงพอตลอดปี'
            ],

            [
                'id'    => 2,
                'label' => '2.มีภาชนะเก็บกักน้ำอุปโภคบริโภค สะอาดมีฝาปิดและรักษาความสะอาดอย่างสม่ำเสมอ	'
            ],

            [
                'id'    => 3,
                'label' => '3.ครัวเรือนนี้มีการจัดบริเวณบ้านและภายในบ้าน โดยมีที่ประกอบอาหาร มีที่เก็บน้ำสะอาด'
            ]

        ];
    }
}

if (!function_exists('__jobs4_7_1')) {
    function __jobs4_7_1()
    {
        return [
            [
                'id'    => 'ไม่มี',
                'label' => 'ไม่มี'
            ],

            [
                'id'    => 1,
                'label' => '1.การเก็บกักน้ำฝนไว้ใช้'
            ],

            [
                'id'    => 2,
                'label' => '2.การใช้น้ำประปา'
            ],

            [
                'id'    => 3,
                'label' => '3.การใช้น้ำกรอง'
            ],

            [
                'id'    => 4,
                'label' => '4.การใช้น้ำบ่อ'
            ],

            [
                'id'    => 5,
                'label' => '5.การใช้น้ำบาดาล'
            ],

            [
                'id'    => 6,
                'label' => '6.การใช้น้ำจากแหล่งน้ำธรรมชาติ'
            ],

            [
                'id'    => 7,
                'label' => '7.การซื้อน้ำสะอาด'
            ]

        ];
    }
}

if (!function_exists('__jobs4_7_2')) {
    function __jobs4_7_2()
    {
        return [
            [
                'id'    => 'มี',
                'label' => 'มี'
            ],

            [
                'id'    => 'ไม่มี',
                'label' => 'ไม่มี'
            ]
        ];
    }
}

if (!function_exists('__jobs4_7_3')) {
    function __jobs4_7_3()
    {
        return [
            [
                'id'    => 'ไม่มี',
                'label' => 'ไม่มี'
            ],

            [
                'id'    => 1,
                'label' => '1.จัดเก็บไว้ในบ้าน'
            ],

            [
                'id'    => 2,
                'label' => '2.จัดเก็บน้ำไว้ภายนอกบ้าน'
            ]
        ];
    }
}

if (!function_exists('__jobs4_8')) {
    function __jobs4_8()
    {
        return [
            [
                'id'    => 'ไม่มี',
                'label' => 'ไม่มี'
            ],

            [
                'id'    => 1,
                'label' => '1.การเก็บขยะในที่สาธารณะ เช่น แม่น้ำ ลำคลอง ชายฝั่งทะเล'
            ],

            [
                'id'    => 2,
                'label' => '2.การขุดลอกคูคลอง'
            ],

            [
                'id'    => 3,
                'label' => '3.การปล่อยสัตว์ป่า/สัตว์น้ำสู่ธรรมชาติ'
            ],

            [
                'id'    => 4,
                'label' => '4.การเก็บกวาดบริเวณบ้านให้สะอาด'
            ],

            [
                'id'    => 5,
                'label' => '5.การหลีกเลี่ยงการใช้ถุงพลาสติก และกล่องโฟม'
            ],

            [
                'id'    => 6,
                'label' => '6=การปลูกป่าไม้/ป่าชายเลน'
            ],

            [
                'id'    => 7,
                'label' => '7.การทำแนวป้องกันไฟป่า/การลาดตระเวนตรวจป่า'
            ],

            [
                'id'    => 8,
                'label' => '8.การอนุรักษ์ดิน/น้ำ เช่น การสร้างฝายชะลอน้ำการปลูกหญ้าแฝก'
            ],

            [
                'id'    => 9,
                'label' => '9.อื่นๆ ระบุ......'
            ]

        ];
    }
}

if (!function_exists('__jobs4_7_9_1')) {
    function __jobs4_9_1()
    {
        return [
            [
                'id'    => 'ไม่มี',
                'label' => 'ไม่มี'
            ],

            [
                'id'    => 1,
                'label' => '1.ไฟฟ้าส่วนภูมิภาค'
            ],

            [
                'id'    => 2,
                'label' => '2.ไฟฟ้าผลิตเอง (พลังงานแสงอาทิตย์ พลังงานลม พลังงานน้ำ)'
            ]
        ];
    }
}

if (!function_exists('__jobs4_7_9_2')) {
    function __jobs4_9_2()
    {
        return [
            [
                'id'    => 'ไม่มี',
                'label' => 'ไม่มี'
            ],

            [
                'id'    => 1,
                'label' => '1.ลดการใช้ไฟฟ้าบางช่วงเวลา'
            ],

            [
                'id'    => 2,
                'label' => '2.ใช้พลังงานทดแทน เช่น ก๊าซชีวภาพ ถ่านอัดแท่ง พลังงานแสงอาทิตย์'
            ],

            [
                'id'    => 3,
                'label' => '3.เลือกใช้เครื่องมือและอุปกรณ์ที่มีประสิทธิภาพสูง เช่น เครื่องใช้ไฟฟ้าเบอร์ 5 หลอดผอมประหยัดไฟ'
            ],

            [
                'id'    => 4,
                'label' => '4.เลือกใช้อุปกรณ์เพิ่มประสิทธิภาพเชื้อเพลิง เช่น เตาถ่านประสิทธิภาพสูง เตาชีวมวล'
            ],

            [
                'id'    => 5,
                'label' => '5.ใช้จักรยานแทนการใช้รถยนต์และรถจักรยานยนต์'
            ],

            [
                'id'    => 6,
                'label' => '6.อื่นๆ (ระบุ)..............'
            ]

        ];
    }
}

if (!function_exists('__jobs4_7_10')) {
    function __jobs4_10()
    {
        return [
            [
                'id'    => 'ไม่มี',
                'label' => 'ไม่มี'
            ],

            [
                'id'    => 1,
                'label' => '1.น้ำท่วม'
            ],

            [
                'id'    => 2,
                'label' => '2.ดินถล่ม'
            ],

            [
                'id'    => 3,
                'label' => '3.ไฟป่า'
            ],

            [
                'id'    => 4,
                'label' => '4.ภัยแล้ง'
            ],

            [
                'id'    => 5,
                'label' => '5.พายุ'
            ],

            [
                'id'    => 6,
                'label' => '6.แผ่นดินไหว'
            ],

            [
                'id'    => 7,
                'label' => '7.น้ำกัดเซาะชายฝั่งทะเล'
            ],

            [
                'id'    => 8,
                'label' => '8.อื่นๆ (ระบุ)...............'
            ]

        ];
    }
}

if (!function_exists('__jobs4_11')) {
    function __jobs4_11()
    {
        return [
            [
                'id'    => 'ไม่มี',
                'label' => 'ไม่มี'
            ],

            [
                'id'    => 1,
                'label' => '1.เตรียมอุปกรณ์หรือของใช้ที่จำเป็นเมื่อเกิดภัยพิบัติ'
            ],

            [
                'id'    => 2,
                'label' => '2.อพยพไปอยู่ในที่ปลอดภัย'
            ],

            [
                'id'    => 3,
                'label' => '3.ซ่อมแซม หรือปรับปรุงบ้านเรือน'
            ],

            [
                'id'    => 4,
                'label' => '4.ร่วมประชุมวางแผนป้องกัน หรือแก้ไขปัญหา'
            ],

            [
                'id'    => 5,
                'label' => '5.ร่วมเป็นอาสาสมัครช่วยเหลือ'
            ],

            [
                'id'    => 6,
                'label' => '6.ร่วมสำรวจข้อมูล'
            ],

            [
                'id'    => 7,
                'label' => '7.ร่วมเฝ้าระวังและเตือนภัย'
            ],

            [
                'id'    => 8,
                'label' => '8.ร่วมเป็นสมาชิกกองทุนภัยพิบัติ'
            ],

            [
                'id'    => 9,
                'label' => '9.อื่นๆ (ระบุ)..............'
            ]

        ];
    }
}
