<?php

return [
    'welcome'      => 'ยินดีต้อนรับสู่คณะวิทยาการอิสลาม ม.อ. ปัตตานี',
    'publish'      => 'ประชาสัมพันธ์',
    'calendar'     => 'ปฏิทินกิจกรรม',
    'remark'       => [
        [
            'title'       => 'สถาบันการศึกษาชั้นนำ',
            'description' => 'เปิดสอนด้านการบริหารจัดการ การบัญชี และรัฐประศาสนศาสตร์แห่งแรกในภาคใต้'
        ],
        [
            'title'       => 'สนับสนุนการเรียนรู้',
            'description' => 'ด้วยสิ่งสนับสนุนการเรึยนรู้ด้วยตัวเองที่ได้รับมาตรฐาน พร้อมให้บริการ'
        ],
        [
            'title'       => 'รวมทั้งสิ้น 14 หลักสูตร',
            'description' => 'ปริญญาตรี 9 หลักสูตร ปริญญาโท 4 หลักสูตร และปริญญาเอก 1 หลักสูตร'
        ],
        [
            'title'       => 'หลักสูตรทันสมัยมุ่งสู่สากล',
            'description' => 'ด้วยบุคลากรหลากหลายสาขาวิชา ที่มีศักยภาพพร้อมถ่ายทอดความรู้'
        ],
        [
            'title'       => 'เปิดสอนในทุกระดับ',
            'description' => 'ทั้งในหลักสูตรระดับปริญญาตรี ปริญญาโท และปริญญาเอก'
        ],
        [
            'title'       => 'ภาคใต้ 3 สาขาวิชา',
            'description' => 'สาขาวิชาบริหารธุรกิจ สาขาวิชาการบัญชี และสาขาวิชารัฐประศาสนศาสตร์'
        ]
    ],
    'contact_dean' => [
        'title'       => 'สายตรงคณบดี',
        'description' => 'เพื่อความรวดเร็วในการติดต่อกลับ<br/>กรุณาตรวจสอบความถูกต้อง และกรอกแบบฟอร์มให้ครบทุกช่อง',
        'button_text' => 'กรอกแบบฟอร์ม'
    ],
    'footer'       => [
        'contact'  => [
            'title'  => 'ติดต่อเรา',
            'detail' => '
                <p>
                    15 ถนนกาญจนวณิชย์ อำเภอหาดใหญ่<br>
                    จังหวัดสงขลา 90112</p>
                <p>
                    โทรศัพท์ : +66-7428-7900<br>
                    โทรสาร : +66-7428-7890<br>
                    Email : fms-info@group.psu.ac.th
                </p>
            '
        ],
        'about_us' => [
            'title' => 'เกี่ยวกับคณะ',
            'lists' => [
                'ประวัติการก่อตั้ง',
                'สิ่งอำนวยความสะดวก',
                'คณะผู้บริหาร',
                'บุคลากรสายสนับสนุน',
                'กองทุนวิจัย',
                'วารสารวิทยาการจัดการ'
            ]
        ],
        'website'  => [
            'title' => 'เว็บไซต์ที่เกี่ยวข้อง',
            'lists' => [
                'มหาวิทยาลัยสงขลานครินทร์',
                'งานทะเบียนกลาง',
                'กองกิจการนักศึกษา',
                'ระบบการจัดการเรียนรู้',
                'ระบบสารสนเทศนักศึกษา',
                'ทรานสคริปกิจกรรมนักศึกษา'
            ]
        ]
    ]
];
